Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/returning_to_education/index.html.txt.tmx
Source language: en
Languages: ga

source: Sources of information on returning to education
ga: Foinsí eolais maidir le filleadh ar oideachas

source: There is a range of options and information available to people who are thinking of returning to education
ga: Tá raon roghanna agus faisnéise ar fáil do dhaoine atá ag smaoineamh filleadh ar oideachas

source: This document gives an overview of the different types of education available to adults outside the school system
ga: Soláthraíonn an doiciméad seo forbhreathnú ar na cineálacha éagsúla oideachais aosaigh atá ar fáil do dhaoine fásta lasmuigh den chóras scolaíochta

source: Back to Education Initiative
ga: Tionscnamh um Fhilleadh ar Oideachas

source: Provides opportunities for adult learners and early school-leavers who want to upgrade their skills
ga: Soláthraítear deiseanna do gach foghlaimeoir fásta agus gach luathfhágóir scoile ar mian leo a scileanna a uasghrádú

source: The adult literacy service provided by the 16 Educational and Training Boards aims to help adults with reading and writing difficulties
ga: Déanann an cháipéis seo cur síos ar Scéim Litearthachta do Dhaoine Fásta an Choiste Ghairmoideachais, scéim a reachtáileann

source: There are a vast range of organisations offering evening and night classes throughout Ireland. Information regarding costs, application procedures and term times
ga: Tá cur síos sa gcáipéis seo ar an réimse eagraíochtaí a chuireann ranganna oíche ar fáil, agus eolas maidir le costaisí iarratais agus na téarmaí ina mbíonn na cúrsaí ar siúl

source: Community education is adult education and lifelong learning which is based in the community, generally outside the formal education sector
ga: Is é atá in oideachas pobail ná oideachas aosach agus foghlaim fadsaoil atá lonnaithe sa phobal, taobh amuigh d'earnáil an oideachais fhoirmiúla de ghnáth

source: Vocational Training Opportunities Scheme
ga: Scéim Deiseanna Oiliúna Gairmoideachais

source: The VTOS scheme offers education and training courses for jobseekers and others getting certain social welfare payments
ga: Is éard atá sa scéim seo réimse cúrsaí oideachais agus oiliúna atá feiliúnach do dhaoine fásta dífhostaithe agus do dhaoine eile a fhaigheann íocaíochtaí leasa shóisialaigh ar leith

source: Back to Education Allowance
ga: Liúntas um Fhilleadh ar Oideachas

source: The Back to Education Allowance Scheme helps people who are unemployed, are getting a One-Parent Family Payment or have a disability, to attend approved second-or third-level education courses
ga: Tá an Scéim Liúntas um Fhilleadh ar Oideachas dírithe orthu atá dífhostaithe, ag fáil Íocaíocht Teaghlaigh Aontuismitheora nó tá míchumas orthu chun cúrsaí dara nó tríú leibhéil ceadaithe a dhéanamh

source: This document is in: Social Welfare > Social welfare payments > Back to Education
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Filleadh ar Oideachas

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
